    #   < ：小于，用于判断变量是否小于常量
    #   > ： 大于，用于判断变量是否大于常量
    #   >= ：大于或等于，用于判断变量是否大于或等于常量
    #   <= ：小于或等于，用于判断变量是否小于或等于常量
    #   == ：等于，用于判断两个常量是否相等
    #   != :不等于，用于判断两个常量是否不等于
while True:
    me = int(input())
    wl = int(input())
    if me == 520 and wl != 520:
        print('这不是你的真心话')
    elif me > 5 and wl < 7:
        print('我跟你的相遇就像是酸遇上了碱，我们彼此中和，释放出了热与激情。')
        print('我对你的感情就像是钡离子与硫酸根的完美结合，生成了美好的感情沉淀。')
        print('我知道你的未来就像是Li  Na K Ru Cr Ba Ca Sr 的焰色反应一样五彩缤纷，最后希望你能像王水一样所向无敌，溶解掉所有的困难，走向成功。')
    elif me >=64 and wl <= 103:
        print('我爱你，我会爱你爱到CuSO4 + Ba(OH)2=BaSO4↓+Cu(OH)2 ↓这两个产物无法分离提纯。')
    elif me and wl == 1314:
        print('我夺走了你的电子，请不要生气，我是为了更稳定的跟你结合在一起.')


